In [ ]:

pd.to_datetime(df_dirty["date"], errors="coerce").max()

Timestamp('2022-12-31 00:00:00')

In [6]:
# Create working copy
import pandas as pd
df_dirty = pd.read_csv("../data/raw/budgetwise_synthetic_dirty.csv")
df = df_dirty.copy()
df.head()

,transaction_id,user_id,date,transaction_type,category,amount,payment_mode,location,notes
0,T03512,U039,December 22 2021,Expense,Rent,998,Cash,Pune,Paid electricity bill
1,T03261,U179,03/24/2022,Expense,Food,$143,Card,Delhi,Grocery shopping
2,T04316,U143,October 18 2022,Expense,Rent,149,Cash,Bengaluru,NaN
3,T05649,U079,12/12/2021,Expense,Rent,49,UPI,NaN,Paid electricity bill
4,T14750,U020,NaN,Income,Other Income,"83,802",Bank Transfer,Chennai,Gift via app

In [7]:
# Remove currency symbols and commas
df["amount"] = df["amount"].str.replace(r"[₹$,]", "", regex=True)

# Convert to numeric
df["amount"] = pd.to_numeric(df["amount"], errors="coerce")

df["amount"].head()

0      998.0
1      143.0
2      149.0
3       49.0
4    83802.0
Name: amount, dtype: float64

In [8]:
# Convert date to datetime
df["date"] = pd.to_datetime(df["date"], errors="coerce")

df["date"].head()

0   2021-12-22
1          NaT
2   2022-10-18
3          NaT
4          NaT
Name: date, dtype: datetime64[us]

In [9]:
# Check missing values
df.isnull().sum()

transaction_id          0
user_id                 0
date                13486
transaction_type        0
category              158
amount                178
payment_mode          503
location              722
notes                1534
dtype: int64

In [10]:
# Drop rows with missing amount or date
df = df.dropna(subset=["amount", "date"])

In [11]:
# Clean category
df["category"] = df["category"].str.strip().str.lower()

# Clean transaction type
df["transaction_type"] = df["transaction_type"].str.strip().str.lower()

In [12]:
df.info()

<class 'pandas.DataFrame'>
Index: 2330 entries, 0 to 15831
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    2330 non-null   str
 1   user_id           2330 non-null   str
 2   date              2330 non-null   datetime64[us]
 3   transaction_type  2330 non-null   str
 4   category          2298 non-null   str
 5   amount            2330 non-null   float64
 6   payment_mode      2262 non-null   str
 7   location          2237 non-null   str
 8   notes             2109 non-null   str
dtypes: datetime64[us](1), float64(1), str(7)
memory usage: 182.0 KB

In [13]:
df.to_csv("../data/processed/cleaned_transactions.csv", index=False)

In [ ]:
## Observations
# dataset contains 15,836 transactions.
# - Total unique users:  192 users.
# - Dataset spans from  2019-01-01 00:00:00  to  2022-12-31 00:00:00 (after parsing date column).
# - Missing values observed in the following columns:
# - date (344 missing)
# - category (158 missing)
# - amount (178 missing)
# - payment_mode (503 missing)
# - location (722 missing)
# - notes (1,534 missing)
# - All columns are currently stored as string (`object`) datatype
# - Amount column contains currency symbols ($, ₹) and comma-separated numeric values
# - Date column contains mixed formats and missing values.
# - Dataset requires data cleaning, type conversion, and handling of missing values before further analysis or modeling.

In [ ]:
import pandas as pd

df_clean = pd.read_csv("../data/raw/budgetwise_finance_dataset.csv")
df_dirty = pd.read_csv("../data/raw/budgetwise_synthetic_dirty.csv")
df_clean.shape
df_dirty.shape

df_clean.columns
df_dirty.columns
df_clean.dtypes
df_dirty.dtypes
df_clean.head()
df_dirty.head()
df_dirty.info()

<class 'pandas.DataFrame'>
RangeIndex: 15836 entries, 0 to 15835
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    15836 non-null  str
 1   user_id           15836 non-null  str
 2   date              15492 non-null  str
 3   transaction_type  15836 non-null  str
 4   category          15678 non-null  str
 5   amount            15658 non-null  str
 6   payment_mode      15333 non-null  str
 7   location          15114 non-null  str
 8   notes             14302 non-null  str
dtypes: str(9)
memory usage: 1.1 MB

In [14]:
import pandas as pd

df = pd.read_csv("../data/processed/cleaned_transactions.csv")

df.head()

,transaction_id,user_id,date,transaction_type,category,amount,payment_mode,location,notes
0,T03512,U039,2021-12-22,expense,rent,998.0,Cash,Pune,Paid electricity bill
1,T04316,U143,2022-10-18,expense,rent,149.0,Cash,Bengaluru,NaN
2,T01814,U150,2019-09-12,expense,savings,681.0,Cash,Kolkata,Salary
3,T04656,U112,2021-02-03,expense,food,323.0,UPI,Ahmedabad,Monthly rent
4,T02596,U050,2021-03-03,income,other income,58874.0,Card,Bengaluru,Salary

In [15]:
df["date"] = pd.to_datetime(df["date"])

In [18]:
df["year"] = df["date"].dt.year
df["month"] = df["date"].dt.month
df.head()

,transaction_id,user_id,date,transaction_type,category,amount,payment_mode,location,notes,year,month
0,T03512,U039,2021-12-22,expense,rent,998.0,Cash,Pune,Paid electricity bill,2021,12
1,T04316,U143,2022-10-18,expense,rent,149.0,Cash,Bengaluru,NaN,2022,10
2,T01814,U150,2019-09-12,expense,savings,681.0,Cash,Kolkata,Salary,2019,9
3,T04656,U112,2021-02-03,expense,food,323.0,UPI,Ahmedabad,Monthly rent,2021,2
4,T02596,U050,2021-03-03,income,other income,58874.0,Card,Bengaluru,Salary,2021,3

In [20]:
df["is_income"] = df["transaction_type"].apply(
    lambda x: 1 if x == "income" else 0
)

df["is_expense"] = df["transaction_type"].apply(
    lambda x: 1 if x == "expense" else 0
)
df.head()

,transaction_id,user_id,date,transaction_type,category,amount,payment_mode,location,notes,year,month,is_income,is_expense
0,T03512,U039,2021-12-22,expense,rent,998.0,Cash,Pune,Paid electricity bill,2021,12,0,1
1,T04316,U143,2022-10-18,expense,rent,149.0,Cash,Bengaluru,NaN,2022,10,0,1
2,T01814,U150,2019-09-12,expense,savings,681.0,Cash,Kolkata,Salary,2019,9,0,1
3,T04656,U112,2021-02-03,expense,food,323.0,UPI,Ahmedabad,Monthly rent,2021,2,0,1
4,T02596,U050,2021-03-03,income,other income,58874.0,Card,Bengaluru,Salary,2021,3,1,0

In [23]:
monthly_summary = df.groupby(["user_id", "year", "month"]).agg(

    monthly_income=("amount", lambda x: x[df.loc[x.index, "is_income"] == 1].sum()),

    monthly_expense=("amount", lambda x: x[df.loc[x.index, "is_expense"] == 1].sum()),

    transaction_count=("amount", "count"),

    avg_transaction=("amount", "mean")

).reset_index()
monthly_summary.head()

,user_id,year,month,monthly_income,monthly_expense,transaction_count,avg_transaction
0,U001,2019,8,54358.0,0.0,1,54358.0
1,U001,2019,10,0.0,433.0,1,433.0
2,U001,2020,1,44962.0,0.0,1,44962.0
3,U001,2020,6,0.0,13556.0,1,13556.0
4,U001,2020,9,0.0,863.0,1,863.0

In [24]:
monthly_summary["monthly_savings"] = (
    monthly_summary["monthly_income"] -
    monthly_summary["monthly_expense"]
)

In [25]:
monthly_summary["savings_rate"] = (
    monthly_summary["monthly_savings"] /
    (monthly_summary["monthly_income"] + 1)
)

In [26]:
monthly_summary["expense_ratio"] = (
    monthly_summary["monthly_expense"] /
    (monthly_summary["monthly_income"] + 1)
)

In [27]:
monthly_summary.head()

,user_id,year,month,monthly_income,monthly_expense,transaction_count,avg_transaction,monthly_savings,savings_rate,expense_ratio
0,U001,2019,8,54358.0,0.0,1,54358.0,54358.0,0.999982,0.0
1,U001,2019,10,0.0,433.0,1,433.0,-433.0,-433.000000,433.0
2,U001,2020,1,44962.0,0.0,1,44962.0,44962.0,0.999978,0.0
3,U001,2020,6,0.0,13556.0,1,13556.0,-13556.0,-13556.000000,13556.0
4,U001,2020,9,0.0,863.0,1,863.0,-863.0,-863.000000,863.0

In [28]:
monthly_summary.to_csv(
    "../data/processed/monthly_financial_summary.csv",
    index=False
)

In [29]:
monthly_summary = pd.read_csv("../data/processed/monthly_financial_summary.csv")

monthly_summary.head()

,user_id,year,month,monthly_income,monthly_expense,transaction_count,avg_transaction,monthly_savings,savings_rate,expense_ratio
0,U001,2019,8,54358.0,0.0,1,54358.0,54358.0,0.999982,0.0
1,U001,2019,10,0.0,433.0,1,433.0,-433.0,-433.000000,433.0
2,U001,2020,1,44962.0,0.0,1,44962.0,44962.0,0.999978,0.0
3,U001,2020,6,0.0,13556.0,1,13556.0,-13556.0,-13556.000000,13556.0
4,U001,2020,9,0.0,863.0,1,863.0,-863.0,-863.000000,863.0

In [30]:
income_variance = monthly_summary.groupby("user_id")["monthly_income"].std().reset_index()

income_variance.columns = ["user_id", "income_variance"]

income_variance.head()

  user_id  income_variance
0    U001     26365.193216
1    U002     29651.279425
2    U003     29983.688952
3    U004     32390.740356
4    U005     25055.666667

In [31]:
expense_volatility = monthly_summary.groupby("user_id")["monthly_expense"].std().reset_index()

expense_volatility.columns = ["user_id", "expense_volatility"]

expense_volatility.head()

  user_id  expense_volatility
0    U001         3836.668310
1    U002          646.971240
2    U003          455.339554
3    U004          778.465992
4    U005          395.047606

In [32]:
monthly_summary = monthly_summary.merge(income_variance, on="user_id", how="left")

monthly_summary = monthly_summary.merge(expense_volatility, on="user_id", how="left")

monthly_summary.head()

,user_id,year,month,monthly_income,monthly_expense,transaction_count,avg_transaction,monthly_savings,savings_rate,expense_ratio,income_variance,expense_volatility
0,U001,2019,8,54358.0,0.0,1,54358.0,54358.0,0.999982,0.0,26365.193216,3836.66831
1,U001,2019,10,0.0,433.0,1,433.0,-433.0,-433.000000,433.0,26365.193216,3836.66831
2,U001,2020,1,44962.0,0.0,1,44962.0,44962.0,0.999978,0.0,26365.193216,3836.66831
3,U001,2020,6,0.0,13556.0,1,13556.0,-13556.0,-13556.000000,13556.0,26365.193216,3836.66831
4,U001,2020,9,0.0,863.0,1,863.0,-863.0,-863.000000,863.0,26365.193216,3836.66831

In [33]:
monthly_summary["income_variance"] = monthly_summary["income_variance"].fillna(0)

monthly_summary["expense_volatility"] = monthly_summary["expense_volatility"].fillna(0)

In [34]:
monthly_summary.to_csv(
    "../data/processed/monthly_financial_features.csv",
    index=False
)

In [ ]:
monthly_summary.columns

Index(['user_id', 'year', 'month', 'monthly_income', 'monthly_expense',
       'transaction_count', 'avg_transaction', 'monthly_savings',
       'savings_rate', 'expense_ratio', 'income_variance',
       'expense_volatility'],
      dtype='str')

In [ ]:
monthly_summary.head()

,user_id,year,month,monthly_income,monthly_expense,transaction_count,avg_transaction,monthly_savings,savings_rate,expense_ratio,income_variance,expense_volatility
0,U001,2019,8,54358.0,0.0,1,54358.0,54358.0,0.999982,0.0,26365.193216,3836.66831
1,U001,2019,10,0.0,433.0,1,433.0,-433.0,-433.000000,433.0,26365.193216,3836.66831
2,U001,2020,1,44962.0,0.0,1,44962.0,44962.0,0.999978,0.0,26365.193216,3836.66831
3,U001,2020,6,0.0,13556.0,1,13556.0,-13556.0,-13556.000000,13556.0,26365.193216,3836.66831
4,U001,2020,9,0.0,863.0,1,863.0,-863.0,-863.000000,863.0,26365.193216,3836.66831

In [7]:
import pandas as pd
df = pd.read_csv("../data/processed/master_dataset.csv")
print(df["monthly_surplus"].describe())

count    1.959000e+03
mean     5.910373e+03
std      6.446936e+04
min     -1.002377e+06
25%     -8.775000e+02
50%     -3.480000e+02
75%     -9.600000e+01
max      1.887800e+05
Name: monthly_surplus, dtype: float64

In [6]:
import os
print(os.getcwd())

c:\Users\asus\ai-financial-intelligence-system\notebooks